* Moringa Data Science Prep Independent Project: Week 3

Question

Currently MTN Cote d'Ivoire would like to upgrade its technology infrastructure for its mobile users in Ivory Coast. Studying the given dataset, how does MTN Cote d'Ivoire go about the upgrade of its infrastructure strategy within the given cities?

Questions for consideration:

Which cities were the most used city for the three days?
Which cities were the most used during business and home hours?
Datasets Provided

cells_geo_description.xlsx [https://drive.google.com/a/moringaschool.com/file/d/1-rIM5ihDu79RaH7rAs-d-7SQSAQhrY9N/view?usp=sharing]
cells_geo.csv [https://drive.google.com/a/moringaschool.com/file/d/1ABZux280OjL3yWcOn8BDA_f5QsyO0QPU/view?usp=sharing]
CDR_description.xlsx [https://drive.google.com/open?id=1cVoNXl25IO5-_yQk97ThdeqhE6yw8YTD]
CDR 20120507 [http://bit.ly/TelecomDataset1]
CDR 20120508 [http://bit.ly/TelecomDataset2]
CDR 20120509 [http://bit.ly/TelecomDataset3]

In [37]:
# importing required libraries
import pandas as pd
import numpy as np
import io

In [38]:
# loading dataset 1
telcom1_url = 'http://bit.ly/Telcom_dataset1'
telcom1 = pd.read_csv(telcom1_url)
telcom1

     PRODUTC  VALUE               DATETIME  ... COUNTRY_B     CELL_ID     SITE_ID
0      Voice      0  2012-05-06 23:04:37.0  ...     19e2e  /TJNe+Mmtu  /TJNe+Mmtu
1        sms      0  2012-05-06 23:05:25.0  ...     19e2e  /+cKZKIp41  /+cKZKIp41
2        sms     25  2012-05-06 23:05:41.0  ...     19e2e  /u0FSD+ahi  /u0FSD+ahi
3      Voice     56  2012-05-06 23:05:42.0  ...     19e2e  +cNeJzsTp3  +cNeJzsTp3
4      Voice     14  2012-05-06 23:06:29.0  ...     19e2e  051KhYDCpv  051KhYDCpv
...      ...    ...                    ...  ...       ...         ...         ...
4996     sms    100  2012-05-07 00:01:54.0  ...     OTHER  0c2371d9bc  1e751d08a4
4997   Voice      1  2012-05-07 00:01:54.0  ...     19e2e  5fb791cf56  65efe2bc62
4998   Voice      0  2012-05-07 00:01:54.0  ...     19e2e  7773627c12  9ef9616350
4999   Voice      0  2012-05-07 00:01:54.0  ...     19e2e  3f4af49d6c  969b8d0e39
5000   Voice      7  2012-05-07 00:01:54.0  ...     19e2e  6f4d9b77a5  ebfc58af70

[5001 rows x 10 columns]

In [39]:
# loading dataset 2
telcom2_url = 'http://bit.ly/Telcom_dataset2'
telcom2 = pd.read_csv(telcom2_url)
telcom2

     PRODUCT  VALUE              DATE_TIME  ... COUNTRY_B     CELL_ID     SITE_ID
0        sms      0  2012-05-07 23:02:06.0  ...     19e2e  +854AcBQT2  +854AcBQT2
1      Voice      0  2012-05-07 23:03:44.0  ...     19e2e  +854AcBQT2  +854AcBQT2
2        sms      0  2012-05-07 23:04:06.0  ...     19e2e  +laSrk7g6q  +laSrk7g6q
3      Voice     37  2012-05-07 23:04:48.0  ...     19e2e  /xvRrCVKoQ  /xvRrCVKoQ
4        sms     25  2012-05-07 23:04:58.0  ...     19e2e  +bO+qkSonO  +bO+qkSonO
...      ...    ...                    ...  ...       ...         ...         ...
4996     sms      0  2012-05-08 00:01:53.0  ...     19e2e  896459aace  b7d00e59e4
4997     sms     25  2012-05-08 00:01:53.0  ...     19e2e  7e90b35166  211015b14d
4998     sms      0  2012-05-08 00:01:53.0  ...     19e2e  fe70e431df  c7ea989264
4999    data      0  2012-05-08 00:01:53.0  ...     OTHER  ffa6759bb2         NaN
5000   Voice      0  2012-05-08 00:01:53.0  ...     19e2e  8630058aca  b47a998a3e

[5001 rows x 10 columns]

In [40]:
# loading dataset 3
telcom3_url = 'http://bit.ly/Telcom_dataset3'
telcom3 = pd.read_csv(telcom3_url)
telcom3

     PRODUCT  VALUE              DATE_TIME  ... COUNTRY_B      CELLID     SIET_ID
0      Voice     61  2012-05-08 23:01:28.0  ...     19e2e  +38u2u/rfx  +38u2u/rfx
1        sms      0  2012-05-08 23:01:31.0  ...     19e2e  +Fs4mTvdKx  +Fs4mTvdKx
2      Voice     10  2012-05-08 23:02:59.0  ...     19e2e  +ZaaZozy/+  +ZaaZozy/+
3        sms      0  2012-05-08 23:03:04.0  ...     19e2e  +cNeJzsTp3  +cNeJzsTp3
4      Voice     22  2012-05-08 23:03:16.0  ...     19e2e  /eeMklgyJA  /eeMklgyJA
...      ...    ...                    ...  ...       ...         ...         ...
4996   Voice      0  2012-05-09 00:01:43.0  ...     19e2e  2aa04dcab7  f7d63a29e5
4997   Voice     62  2012-05-09 00:01:43.0  ...     19e2e  7f1f2f889f  b4ddb9e93c
4998   Voice     32  2012-05-09 00:01:43.0  ...     19e2e  a4731e780e  d68260ef50
4999   Voice     30  2012-05-09 00:01:43.0  ...     19e2e  98ed726da2  b4130b54ab
5000   Voice     60  2012-05-09 00:01:43.0  ...     19e2e  1c11a2fcbb  6d70dae094

[5001 rows x 10 columns]

In [42]:
# loading dataset 4
#
cells_geo = pd.read_csv('cells_geoo.csv')
cells_geo

      Unnamed: 0    VILLES      STATUS  ...          AREA     CELL_ID   SITE_CODE
0              0    ADJAME  In Service  ...           NaN  fbb2e75af3  0bb492ef17
1              1    ADJAME  In Service  ...           NaN  1502501d78  0bb492ef17
2              2    ADJAME  In Service  ...           NaN  0c2e182a0c  0bb492ef17
3              3   ASSINIE  In Service  ...           NaN  69bdfc69fd  8a1e6ce31f
4              4   ASSINIE  In Service  ...           NaN  7a1029d2ab  8a1e6ce31f
...          ...       ...         ...  ...           ...         ...         ...
3969        3969  ZUENOULA  In Service  ...  CENTRE NORTH  1cfc2d7ab1  f91ed8d2e9
3970        3970  ZUENOULA  In Service  ...  CENTRE NORTH  3ae1708153  f91ed8d2e9
3971        3971  ZUENOULA  In Service  ...  CENTRE NORTH  cb71f8a29c  61bee9c70c
3972        3972  ZUENOULA  In Service  ...  CENTRE NORTH  d4a6a0b645  61bee9c70c
3973        3973  ZUENOULA  In Service  ...  CENTRE NORTH  f9f3e42589  61bee9c70c

[3974 rows x 12 columns]

Exploring the imported datasets

In [43]:
#telecom1 dataset information for things like datatype, just out of interest
#
telcom1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5001 entries, 0 to 5000
Data columns (total 10 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   PRODUTC          5001 non-null   object
 1   VALUE            5001 non-null   int64
 2   DATETIME         5001 non-null   object
 3   CELL_ON_SITE     5001 non-null   object
 4   DW_A_NUMBER_INT  5001 non-null   object
 5   DW_B_NUMBER_INT  5001 non-null   object
 6   COUNTRY_A        5001 non-null   object
 7   COUNTRY_B        5001 non-null   object
 8   CELL_ID          5001 non-null   object
 9   SITE_ID          4285 non-null   object
dtypes: int64(1), object(9)
memory usage: 390.8+ KB

In [44]:
telcom2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5001 entries, 0 to 5000
Data columns (total 10 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   PRODUCT       5001 non-null   object
 1   VALUE         5001 non-null   int64
 2   DATE_TIME     5001 non-null   object
 3   CELL_ON_SITE  5001 non-null   object
 4   DW_A_NUMBER   5001 non-null   object
 5   DW_B_NUMBER   5001 non-null   object
 6   COUNTRY_A     5001 non-null   object
 7   COUNTRY_B     5001 non-null   object
 8   CELL_ID       5001 non-null   object
 9   SITE_ID       4325 non-null   object
dtypes: int64(1), object(9)
memory usage: 390.8+ KB

In [45]:
telcom3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5001 entries, 0 to 5000
Data columns (total 10 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   PRODUCT          5001 non-null   object
 1   VALUE            5001 non-null   int64
 2   DATE_TIME        5001 non-null   object
 3   CELL_ON_SITE     5001 non-null   object
 4   DW_A_NUMBER_INT  5001 non-null   object
 5   DW_B_NUMBER_INT  5001 non-null   object
 6   COUNTRY_A        5001 non-null   object
 7   COUNTRY_B        5001 non-null   object
 8   CELLID           5001 non-null   object
 9   SIET_ID          4396 non-null   object
dtypes: int64(1), object(9)
memory usage: 390.8+ KB

In [46]:
cells_geo.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3974 entries, 0 to 3973
Data columns (total 12 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Unnamed: 0    3974 non-null   int64
 1   VILLES        3974 non-null   object
 2   STATUS        3907 non-null   object
 3   LOCALISATION  3974 non-null   object
 4   DECOUPZONE    3974 non-null   object
 5   ZONENAME      3968 non-null   object
 6   LONGITUDE     3974 non-null   float64
 7   LATITUDE      3974 non-null   float64
 8   REGION        3974 non-null   object
 9   AREA          3951 non-null   object
 10  CELL_ID       3974 non-null   object
 11  SITE_CODE     3974 non-null   object
dtypes: float64(2), int64(1), object(9)
memory usage: 372.7+ KB

Data Cleaning

In [47]:
# dataset1 changing columns to lowercase and renaming them
telcom1.columns = map(str.lower, telcom1.columns)
columns = ['product', 'value', 'datetime', 'cell_on_site', 'dw_a_number_int','dw_b_number_int', 
           'country_a', 'country_b', 'cell_id', 'site_id']
telcom1.columns = columns
telcom1.columns

Index(['product', 'value', 'datetime', 'cell_on_site', 'dw_a_number_int',
       'dw_b_number_int', 'country_a', 'country_b', 'cell_id', 'site_id'],
      dtype='object')

In [48]:
# dataset2 changing columns to lowercase and renaming them
telcom2.columns = map(str.lower, telcom2.columns)
columns = ['product', 'value', 'datetime', 'cell_on_site', 'dw_a_number_int','dw_b_number_int', 
           'country_a', 'country_b', 'cell_id', 'site_id']
telcom2.columns = columns
telcom2.columns

Index(['product', 'value', 'datetime', 'cell_on_site', 'dw_a_number_int',
       'dw_b_number_int', 'country_a', 'country_b', 'cell_id', 'site_id'],
      dtype='object')

In [49]:
# dataset3 changing columns to lowercase and renaming them
telcom3.columns = map(str.lower, telcom3.columns)
columns = ['product', 'value', 'datetime', 'cell_on_site', 'dw_a_number_int','dw_b_number_int', 'country_a', 
           'country_b', 'cell_id', 'site_id']
telcom3.columns = columns
telcom3.columns

Index(['product', 'value', 'datetime', 'cell_on_site', 'dw_a_number_int',
       'dw_b_number_int', 'country_a', 'country_b', 'cell_id', 'site_id'],
      dtype='object')

In [56]:
# dataset4 changing columns to lowercase
# to delete a column in the cells_geo not needed
cells_geo.columns = map(str.lower, cells_geo.columns)
cells_geo.drop('unnamed: 0', axis=1, inplace=True)
cells_geo.columns

Index(['villes', 'status', 'localisation', 'decoupzone', 'zonename',
       'longitude', 'latitude', 'region', 'area', 'cell_id', 'site_code'],
      dtype='object')

In [57]:
# Merging dataset 1 with 4
# 
telcom_merged = telcom1.merge(cells_geo, how='inner', on='cell_id')
telcom_merged.head()

Empty DataFrame
Columns: [product, value, datetime, cell_on_site, dw_a_number_int, dw_b_number_int, country_a, country_b, cell_id, site_id, villes, status, localisation, decoupzone, zonename, longitude, latitude, region, area, site_code]
Index: []

In [58]:
# Checking the shape of the new dataset and displaying
# not getting the desired results of my rows,need to recheck but running out of time for IP
telcom_merged.shape

(0, 20)

In [59]:
# Merging dataset 2 with 4

# 
telcom2_merged = telcom2.merge(cells_geo, how='inner', on='cell_id')
telcom2_merged.head()

Empty DataFrame
Columns: [product, value, datetime, cell_on_site, dw_a_number_int, dw_b_number_int, country_a, country_b, cell_id, site_id, villes, status, localisation, decoupzone, zonename, longitude, latitude, region, area, site_code]
Index: []

In [60]:
# Checking the shape of the new dataset
# not getting the desired results of my rows,need to recheck but running out of time for IP
telcom2_merged.shape

(0, 20)

In [61]:
# Merging dataset 3 with 4 and viewing results
# 
telcom3_merged = telcom3.merge(cells_geo, how='inner', on='cell_id')
telcom3_merged.head()

Empty DataFrame
Columns: [product, value, datetime, cell_on_site, dw_a_number_int, dw_b_number_int, country_a, country_b, cell_id, site_id, villes, status, localisation, decoupzone, zonename, longitude, latitude, region, area, site_code]
Index: []

In [62]:
# Checking the shape of the new dataset
# not getting the desired results of my rows,need to recheck but running out of time for IP
telcom3_merged.shape

(0, 20)

In [63]:
# Combining all three datasets
combined = pd.concat([telcom_merged, telcom2_merged, telcom3_merged], ignore_index=False)

In [64]:
# Viewing the combined dataframe
combined.head()

Empty DataFrame
Columns: [product, value, datetime, cell_on_site, dw_a_number_int, dw_b_number_int, country_a, country_b, cell_id, site_id, villes, status, localisation, decoupzone, zonename, longitude, latitude, region, area, site_code]
Index: []

In [65]:
# drop columns not needed
combined.drop(['country_a', 'country_b', 'cell_on_site'], axis = 1, inplace = True)
combined.head()

Empty DataFrame
Columns: [product, value, datetime, dw_a_number_int, dw_b_number_int, cell_id, site_id, villes, status, localisation, decoupzone, zonename, longitude, latitude, region, area, site_code]
Index: []

In [66]:
#Vieiwing null values
#
combined.isnull().sum()

product            0
value              0
datetime           0
dw_a_number_int    0
dw_b_number_int    0
cell_id            0
site_id            0
villes             0
status             0
localisation       0
decoupzone         0
zonename           0
longitude          0
latitude           0
region             0
area               0
site_code          0
dtype: int64

In [67]:
# Drop site_id column as it is mising alot of values
# 
combined.drop('site_id', axis = 1, inplace = True)

In [68]:
# Replace missing column with median values
# 
combined.fillna(np.median, inplace = True)

Empty DataFrame
Columns: [product, value, datetime, dw_a_number_int, dw_b_number_int, cell_id, villes, status, localisation, decoupzone, zonename, longitude, latitude, region, area, site_code]
Index: []

In [69]:
# Changing datetime column to datetime type
# 
combined.datetime = pd.to_datetime(combined.datetime)

In [70]:
# Splitting the datetime to date and time
# 
combined['date'] = [d.date() for d in combined.datetime]
combined['time'] = [d.time() for d in combined.datetime]
combined['date'] = pd.to_datetime(combined['date'])
combined['time'] = pd.to_datetime(combined['time'], format='%H:%M:%S:%f', errors = 'ignore')

In [71]:
#view changes made
combined.dtypes

product                    object
value                       int64
datetime           datetime64[ns]
dw_a_number_int            object
dw_b_number_int            object
cell_id                    object
villes                     object
status                     object
localisation               object
decoupzone                 object
zonename                   object
longitude                 float64
latitude                  float64
region                     object
area                       object
site_code                  object
date               datetime64[ns]
time               datetime64[ns]
dtype: object

Data Analysis

In [73]:
# Question 1: Which cities were used most during business hours from 9 am to 5 pm?

combined.groupby(['date', 'villes']).size()
import datetime
business_hours = combined[(combined.datetime.dt.time >= datetime.time(9)) & (combined.datetime.dt.time <= datetime.time(17))]
business_hours.groupby('villes')['villes'].count().sort_values(ascending = False)

Series([], Name: villes, dtype: int64)

In [74]:
# Question 2: Which cities were used most during home hours from 5 pm to 9 am?
# 
home_hours = combined[~ ((combined.datetime.dt.time >= datetime.time(9)) & (combined.datetime.dt.time <= datetime.time(17)))]
home_hours.groupby('villes')['villes'].count().sort_values(ascending = False)

Series([], Name: villes, dtype: int64)

In [75]:
# Question 3: Which were the most used cities for the three days?
# 
combined.groupby('villes')['villes'].count().sort_values(ascending = False)

Series([], Name: villes, dtype: int64)